% 把列联表存储在一个矩阵中
x = [768,84,173,126,495,119,145;947,97,236,169,746,186,210;1088,112,309,208,1019,273,285;1249,126,413,260,1288,395,405;1341,133,523,309,1638,532,565;1480,142,631,365,2068,738,793;1556,147,768,423,3019,1196,1187];
% 调用chi2cont函数
[h,p,X2] = chi2cont(x);
% 显示结果
disp(['h = ',num2str(h),', p = ',num2str(p),', X2 = ',num2str(X2)]);
%原假设是：各类别之间相互独立，即每个单元格的概率等于其对应行和列的边际概率的乘积。我的备择假设是：各类别之间不相互独立，即存在某些单元格的概率与其对应行和列的边际概率的乘积不相等。
% h=1拒绝原假设 h=0接受原假设
% 根据自由度（行数-1）（列数-1）以及显著水平α查卡方分布表，大于才行
